### Series

In [92]:
import pandas as pd
import numpy as np
import seaborn

In [31]:
arr = pd.Series([1,4,9,16], name='squares')

In [32]:
arr

0     1
1     4
2     9
3    16
Name: squares, dtype: int64

In [33]:
arr.values

array([ 1,  4,  9, 16], dtype=int64)

In [34]:
arr.index

RangeIndex(start=0, stop=4, step=1)

In [35]:
arr[0]

1

In [36]:
arr[2:3]

2    9
Name: squares, dtype: int64

In [37]:
pop2014 = pd.Series([100,99.3,95.5,93.5,92.4,84.8,84.5,78.9,74.3,72.8],
                    index=['Java','C','C++','Python','C#','PHP','JavaScript','Ruby','R','Matlab'])

In [38]:
pop2014

Java          100.0
C              99.3
C++            95.5
Python         93.5
C#             92.4
PHP            84.8
JavaScript     84.5
Ruby           78.9
R              74.3
Matlab         72.8
dtype: float64

In [39]:
pop2014.index

Index(['Java', 'C', 'C++', 'Python', 'C#', 'PHP', 'JavaScript', 'Ruby', 'R',
       'Matlab'],
      dtype='object')

In [40]:
pop2014[0:8]

Java          100.0
C              99.3
C++            95.5
Python         93.5
C#             92.4
PHP            84.8
JavaScript     84.5
Ruby           78.9
dtype: float64

In [41]:
pop2014['Java':'PHP'] #includes PHP

Java      100.0
C          99.3
C++        95.5
Python     93.5
C#         92.4
PHP        84.8
dtype: float64

In [42]:
# iloc specifies you are using a numeric index
pop2014.iloc[0:2]

Java    100.0
C        99.3
dtype: float64

In [43]:
# loc specifies you are using values for index
pop2014.loc['Java':'C++']

Java    100.0
C        99.3
C++      95.5
dtype: float64

In [44]:
pop2014[pop2014 > 85]

Java      100.0
C          99.3
C++        95.5
Python     93.5
C#         92.4
dtype: float64

In [45]:
# creating panda from dict
pop2015 = pd.Series({'Java': 100,'C': 99.9,'C++': 99.4,'Python': 96.5,'C#': 91.3,
                     'R': 84.8,'PHP': 84.5, 'JavaScript': 83.0, 'Ruby': 76.2, 'Matlab': 72.4})
pop2015

C              99.9
C#             91.3
C++            99.4
Java          100.0
JavaScript     83.0
Matlab         72.4
PHP            84.5
Python         96.5
R              84.8
Ruby           76.2
dtype: float64

### Dataframes

In [49]:
twoyears = pd.DataFrame({'2014':pop2014,'2015':pop2015})
twoyears

             2014   2015
C            99.3   99.9
C#           92.4   91.3
C++          95.5   99.4
Java        100.0  100.0
JavaScript   84.5   83.0
Matlab       72.8   72.4
PHP          84.8   84.5
Python       93.5   96.5
R            74.3   84.8
Ruby         78.9   76.2

In [59]:
twoyears = twoyears.sort_values('2015', ascending=False)
twoyears

             2014   2015
Java        100.0  100.0
C            99.3   99.9
C++          95.5   99.4
Python       93.5   96.5
C#           92.4   91.3
R            74.3   84.8
PHP          84.8   84.5
JavaScript   84.5   83.0
Ruby         78.9   76.2
Matlab       72.8   72.4

In [60]:
twoyears.iloc[0:2]

       2014   2015
Java  100.0  100.0
C      99.3   99.9

In [61]:
twoyears.loc['R':'Ruby']

            2014  2015
R           74.3  84.8
PHP         84.8  84.5
JavaScript  84.5  83.0
Ruby        78.9  76.2

In [62]:
mean = (twoyears['2014'] + twoyears['2015']) * 0.5
mean

Java          100.00
C              99.60
C++            97.45
Python         95.00
C#             91.85
R              79.55
PHP            84.65
JavaScript     83.75
Ruby           77.55
Matlab         72.60
dtype: float64

In [63]:
twoyears['mean'] = mean
twoyears

             2014   2015    mean
Java        100.0  100.0  100.00
C            99.3   99.9   99.60
C++          95.5   99.4   97.45
Python       93.5   96.5   95.00
C#           92.4   91.3   91.85
R            74.3   84.8   79.55
PHP          84.8   84.5   84.65
JavaScript   84.5   83.0   83.75
Ruby         78.9   76.2   77.55
Matlab       72.8   72.4   72.60

In [66]:
presidents = pd.DataFrame([{'name': 'Barack Obama','inauguration': 2009,'birth': 1961},
                         {'name': 'George W Bush', 'inauguration': 2001, 'birth': 1946},
                         {'name': 'Bill Clinton', 'inauguration':1993, 'birth': 1946}]) # using [] gives enumeration
presidents

   birth  inauguration           name
0   1961          2009   Barack Obama
1   1946          2001  George W Bush
2   1946          1993   Bill Clinton

In [67]:
presidents_w_index = presidents.set_index('name')
presidents_w_index

               birth  inauguration
name
Barack Obama    1961          2009
George W Bush   1946          2001
Bill Clinton    1946          1993

In [75]:
presidents_w_index['inauguration']

name
Barack Obama     2009
George W Bush    2001
Bill Clinton     1993
Name: inauguration, dtype: int64

In [80]:
presidents_w_index.loc['Barack Obama']

birth           1961
inauguration    2009
Name: Barack Obama, dtype: int64

In [81]:
presidents_w_index['inauguration']['Bill Clinton']

1993

### Joins example

In [86]:
presidents_fathers = pd.DataFrame ([{'son': 'Barack Obama','father': 'Barack Obama Sr'},
                         {'son': 'George W Bush', 'father': 'George W Bush'}])
presidents_fathers

            father            son
0  Barack Obama Sr   Barack Obama
1    George W Bush  George W Bush

In [87]:
pd.merge(presidents,presidents_fathers,left_on='name',right_on='son')

   birth  inauguration           name           father            son
0   1961          2009   Barack Obama  Barack Obama Sr   Barack Obama
1   1946          2001  George W Bush    George W Bush  George W Bush

In [88]:
pd.merge(presidents,presidents_fathers,left_on='name',right_on='son').drop('son', axis=1)

   birth  inauguration           name           father
0   1961          2009   Barack Obama  Barack Obama Sr
1   1946          2001  George W Bush    George W Bush

In [89]:
pd.merge(presidents,presidents_fathers,left_on='name',right_on='son',how='left').drop('son', axis=1)

   birth  inauguration           name           father
0   1961          2009   Barack Obama  Barack Obama Sr
1   1946          2001  George W Bush    George W Bush
2   1946          1993   Bill Clinton              NaN

### Multilevel Indices

In [94]:
 flights = seaborn.load_dataset('flights')

In [95]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [96]:
indexed = flights.set_index(['year','month'])

In [99]:
indexed.head()

               passengers
year month
1949 January          112
     February         118
     March            132
     April            129
     May              121

In [101]:
indexed.loc[1951]

           passengers
month
January           145
February          150
March             178
April             163
May               172
June              178
July              199
August            199
September         184
October           162
November          146
December          166

In [104]:
indexed.loc[1951,'May']

passengers    172
Name: (1951, May), dtype: int64

In [105]:
indexed.loc[1951].loc['January':'June']

          passengers
month
January          145
February         150
March            178
April            163
May              172
June             178

In [107]:
unstacked = indexed.unstack()

### Aggregation

In [108]:
tips = pd.read_csv('tips.csv')

In [109]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [110]:
tips.mean()

total_bill    19.785943
tip            2.998279
size           2.569672
dtype: float64

In [111]:
tips.describe() # first row shown is total entries

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [112]:
tips.groupby('sex').mean()

        total_bill       tip      size
sex
Female   18.056897  2.833448  2.459770
Male     20.744076  3.089618  2.630573

In [114]:
tips.groupby(['sex','smoker']).mean()

               total_bill       tip      size
sex    smoker
Female No       18.105185  2.773519  2.592593
       Yes      17.977879  2.931515  2.242424
Male   No       19.791237  3.113402  2.711340
       Yes      22.284500  3.051167  2.500000

In [119]:
pd.pivot_table(tips,'total_bill','sex','smoker') # pass group keys

smoker         No        Yes
sex
Female  18.105185  17.977879
Male    19.791237  22.284500

In [121]:
pd.pivot_table(tips,'total_bill',['sex','smoker'],['day','time'])

day               Fri                   Sat        Sun   Thur
time           Dinner      Lunch     Dinner     Dinner Dinner      Lunch
sex    smoker
Female No      22.750  15.980000  19.003846  20.824286  18.78  15.899167
       Yes     12.200  13.260000  20.266667  16.540000    NaN  19.218571
Male   No      17.475        NaN  19.929063  20.403256    NaN  18.486500
       Yes     25.892  11.386667  21.837778  26.141333    NaN  19.171000

In [124]:
arr = []
arr.append(presidents)

In [125]:
arr

[   birth  inauguration           name
 0   1961          2009   Barack Obama
 1   1946          2001  George W Bush
 2   1946          1993   Bill Clinton]

In [126]:
arr[-1]['year'] = 2001
arr

[   birth  inauguration           name  year
 0   1961          2009   Barack Obama  2001
 1   1946          2001  George W Bush  2001
 2   1946          1993   Bill Clinton  2001]